In [3]:
import pandas as pd

In [3]:
# Задание 1

ratings = pd.read_csv('ratings.csv')
ratings.head(7)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510
5       1     1088     4.0  1147868495
6       1     1175     3.5  1147868826

In [6]:
sabset = ratings[['movieId','rating']][ratings['rating'] == 5].groupby('movieId').count()
resalt = sabset.sort_values('rating', ascending=False)

resalt.head(10)

         rating
movieId
318       39553
296       32169
356       25918
260       25804
2571      25482
527       24853
593       24801
858       24418
50        21585
2959      21486

In [4]:
# Задание 2

data = pd.read_csv('power.csv')
data.head(7)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1

In [11]:
filtered_countries = data[ (data['country'] == 'Latvia') | (data['country'] == 'Lithuania') | (data['country'] == 'Estonia') ]
filtered_category = filtered_countries[ (filtered_countries['category'] == 4) | (filtered_countries['category'] == 12) | (filtered_countries['category'] == 21) ]
# filtered_year = filtered_category[ (filtered_category['year'] == 2005) | (filtered_category['year'] == 2006) | (filtered_category['year'] == 2007) | (filtered_category['year'] == 2008) | (filtered_category['year'] == 2009) | (filtered_category['year'] == 2010)]
filtered_year = filtered_category[ (filtered_category['year'] >= 2005) & (filtered_category['year'] <= 2010) ]
result = filtered_year[filtered_year['quantity'] > 0]
result_sum = result['quantity'].sum()

print('Cуммарное потребление стран Прибалтики', result_sum)

Cуммарное потребление стран Прибалтики 240580.0

In [73]:
# Задание 3 не уяснила смысла этого задания

data_3 = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[0]
type(data_3)

pandas.core.frame.DataFrame